app/controllers/api/v1/channels_controller.rb

  def create
    @api_v1_channel = Api::V1::Channel.new(api_v1_channel_params)
    if @api_v1_channel.save
---
INSERT INTO "api_v1_channels" ("name", "author_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "music"], ["author_name", "test"], ["created_at", "2022-06-23 07:10:08.241685"], ["updated_at", "2022-06-23 07:10:08.241685"]]

  def update
    if @api_v1_channel.update(api_v1_channel_params)
---
UPDATE "api_v1_channels" SET "name" = $1, "updated_at" = $2 WHERE "api_v1_channels"."id" = $3  [["name", "testchanne1"], ["updated_at", "2022-06-23 11:45:57.717302"], ["id", 1]]