app/controllers/api/v1/message_replies_controller.rb

INSERT INTO "api_v1_message_replies" ("message", "message_id", "author_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["message", "sometext"], ["message_id", 1], ["author_name", "test2"], ["created_at", "2022-06-23 12:12:48.785241"], ["updated_at", "2022-06-23 12:12:48.785241"]]
---
  def create
    @api_v1_message_reply = Api::V1::MessageReply.new(api_v1_message_reply_params)
    @api_v1_message_reply.author_name = current_user.name
    if @api_v1_message_reply.save