app/controllers/api/v1/messages_controller.rb

INSERT INTO "api_v1_messages" ("message", "author_name", "receiver_name", "channel_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["message", "sometext"], ["author_name", "test"], ["receiver_name", "test2"], ["channel_id", 1], ["created_at", "2022-06-23 11:54:27.894803"], ["updated_at", "2022-06-23 11:54:27.894803"]]
---
  def create
    @api_v1_message = Api::V1::Message.new(api_v1_message_params)
    @api_v1_message.author_name = current_user.name
    if @api_v1_message.save